function PDPAConsent() {
  return (
    <>
      <p>
        ในการ..............(ระบุวัตถุประสงค์ในการขอความยินยอม เช่น
        ให้สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน)
        เปิดเผยข้อมูลส่วนบุคคลให้คู่ค้าและ/หรือพันธมิตรทางธุรกิจ
        เพื่อการวิเคราะห์ คัดสรรและนำเสนอผลิตภัณฑ์หรือบริการ สิทธิประโยชน์
        รายการส่งเสริมการขาย หรือข้อเสนอต่าง ๆ
        ของคู่ค้าและ/หรือพันธมิตรนั้น)................ 
        </p>
        <p>
        ทั้งนี้ ก่อนการแสดงเจตนา
        ข้าพเจ้าได้อ่านรายละเอียดจากเอกสารชี้แจงข้อมูล
        หรือได้รับคำอธิบายจากสำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน)
        ถึงวัตถุประสงค์ในการเก็บรวบรวม ใช้หรือเปิดเผย (“ประมวลผล”)
        ข้อมูลส่วนบุคคล และมีความเข้าใจดีแล้ว
        </p>
        <p>
        ข้าพเจ้าให้ความยินยอมหรือปฏิเสธไม่ให้ความยินยอมในเอกสารนี้ด้วยความสมัครใจ
        ปราศจากการบังคับหรือชักจูง
        และข้าพเจ้าทราบว่าข้าพเจ้าสามารถถอนความยินยอมนี้เสียเมื่อใดก็ได้เว้นแต่ในกรณีมีข้อจำกัดสิทธิตามกฎหมายหรือยังมีสัญญาระหว่างข้าพเจ้ากับสำนักงานพัฒนารัฐบาลดิจิทัล
        (องค์การมหาชน) ที่ให้ประโยชน์แก่ข้าพเจ้าอยู่
        กรณีที่ข้าพเจ้าประสงค์จะขอถอนความยินยอม
        </p>
        <p>
        ข้าพเจ้าทราบว่าการถอนความยินยอมจะมีผลทำให้.....(ระบุผลกระทบจากการถอนความยินยอม
        เช่น ข้าพเจ้าอาจได้รับความสะดวกในการใช้บริการน้อยลง หรือ
        ไม่สามารถเข้าถึงฟังก์ชันการใช้งานบางอย่างได้ เป็นต้น).....
        และข้าพเจ้าทราบว่าการถอนความยินยอมดังกล่าว
        ไม่มีผลกระทบต่อการประมวลผลข้อมูลส่วนบุคคลที่ได้ดำเนินการเสร็จสิ้นไปแล้วก่อนการถอนความยินยอม
      </p>
    </>
  );
}

export default PDPAConsent;
